answer = ["イギリス","イギリス","スペイン","ドイツ","フランス","イギリス","フランス","フランス","イギリス","フランス","フランス","イギリス","フランス","フランス","スペイン","イタリア","イタリア","スペイン","イタリア","スペイン","イタリア","イタリア","スペイン","イタリア","イタリア","イギリス","スペイン","ドイツ","フランス","フランス","イタリア","イタリア","スペイン","スペイン","イタリア","イタリア","ドイツ","イタリア","イタリア","イタリア"]
# 空の辞書を用意
results = {}    # 辞書を扱うオブジェクトを生成．最初は中身がないため{}を代入
# 辞書resultsに国と得票数を格納
for country in answer:    # リストanswerから国名を取り出し変数countryに格納
    if country in results:    # 辞書resultsにキーとして含まれているか？
        results[country] += 1 # すでにキーがあれば値をカウントアップ
    else:
        results[country] = 1  # キーがなければ1を設定
for country, num in results.items():    # items()のタプル型による返り値を受ける
    print(country + ":" + str(num))
